#ifndef __USART_H
#define __USART_H
#include "stm32f4xx.h"
#include "stdio.h"
#include "os_cpu.h"
 /******************************************************************************
  * 文件路径  ：   Hardware/usart/usart.h 
  * 作者      ：   农晓明   QQ：382421307
  * 固件库版本：   V1.0.0
  * 日期      ：   2012-03-28
  * 文件描述  ：   提供对板上串口的配置
  ******************************************************************************/
/*******************************************************************************************************************************
 * 函数名：USART1_Config()
 * 参数：无
 *返回值：无
 * 功能：配置USART1，并初始化
********************************************************************************************************************************/		
void USART1_RXLoop(INT8U temp);     //   将temp放入环形数组，接收中断调用																
void USART1_Config(void);
INT8U USART1_GetByte(INT8U *temp);  //   从环形数组取一个字节
void USART1_SendByte(INT8U temp);   //   发送一个字节
void USART1_Printf(INT8U *pch);     //   打印字符串
/********************************************************************************************************************************
*函数名：fputc()
* 参数：int ch，FILE *f
* 返回值：int
* 功能：重新定义stdio.h中的fputc()函数，使printf()输出到USART1
*********************************************************************************************************************************/
int fputc(int ch,FILE *f);
#endif
